Revit 2027 API
BuiltInFailures.GroupFailures.BadViewForAttachedGroupWarn Property
 Attached groups can only be created for view specific elements belonging to non-3d model views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadViewForAttachedGroupWarn { get; }
Public Shared ReadOnly Property BadViewForAttachedGroupWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadViewForAttachedGroupWarn {
	FailureDefinitionId^ get ();
}
static member BadViewForAttachedGroupWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace